In [1]:
import pandas as pd
#create DataFrames
df1 = pd.DataFrame({'id' : ['A', 'B', 'C', 'D'],
                    'age' : [30, 23, 25, 22]
                    })

df2 = pd.DataFrame({'id' : ['C', 'D', 'E', 'F'],
                    'job' : ['Doctor', 'Engineer', 'Artist', 'Programmer']
                    })

In [3]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [4]:
df2

  id         job
0  C      Doctor
1  D    Engineer
2  E      Artist
3  F  Programmer

<center>
    <h2>Merge Method</h2>
</center>

In [7]:
#variable
df_inner = df1.merge(df2, on='id', how='inner')
#show result
df1.merge(df2, on='id', how='inner')

  id  age       job
0  C   25    Doctor
1  D   22  Engineer

In [8]:
#show shape (rows, columns)
print(df1.shape)
print(df2.shape)
print(df_inner.shape)

(4, 2)
(4, 2)
(2, 3)